Revit 2024 API
ProgressChangedEventArgs.Stage Property
 The current stage of the progress bar
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ProgressStage Stage { get; }
Visual Basic
Public ReadOnly Property Stage As ProgressStage
	Get
Visual C++
public:
property ProgressStage Stage {
	ProgressStage get ();
}
See Also
ProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace